# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

N = int(input('Введите N:'))

for i in range(N):
    print(2**i, end=' ')
